zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE32B/MCXE32B_cm7_core0_COMMON.h
/*
** ###################################################################
**     Processor:           MCXE32BMPB_cm7_core0
**     Compilers:
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    MCXE31 RM Rev2
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260609
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MCXE32B_cm7_core0
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file MCXE32B_cm7_core0_COMMON.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for MCXE32B_cm7_core0
 *
 * CMSIS Peripheral Access Layer for MCXE32B_cm7_core0
 */

#if !defined(MCXE32B_CM7_CORE0_COMMON_H_)
#define MCXE32B_CM7_CORE0_COMMON_H_              /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 240                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M7 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M7 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M7 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M7 Usage Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M7 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M7 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M7 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M7 System Tick Interrupt */

  /* Device specific interrupts */
  INT0_IRQn                    = 0,                /**< CPU to CPU int0 */
  INT1_IRQn                    = 1,                /**< CPU to CPU int1 */
  INT2_IRQn                    = 2,                /**< CPU to CPU int2 */
  INT3_IRQn                    = 3,                /**< CPU to CPU int3 */
  DMATCD0_IRQn                 = 4,                /**< DMA transfer complete and error CH0 */
  DMATCD1_IRQn                 = 5,                /**< DMA transfer complete and error CH1 */
  DMATCD2_IRQn                 = 6,                /**< DMA transfer complete and error CH2 */
  DMATCD3_IRQn                 = 7,                /**< DMA transfer complete and error CH3 */
  DMATCD4_IRQn                 = 8,                /**< DMA transfer complete and error CH4 */
  DMATCD5_IRQn                 = 9,                /**< DMA transfer complete and error CH5 */
  DMATCD6_IRQn                 = 10,               /**< DMA transfer complete and error CH6 */
  DMATCD7_IRQn                 = 11,               /**< DMA transfer complete and error CH7 */
  DMATCD8_IRQn                 = 12,               /**< DMA transfer complete and error CH8 */
  DMATCD9_IRQn                 = 13,               /**< DMA transfer complete and error CH9 */
  DMATCD10_IRQn                = 14,               /**< DMA transfer complete and error CH10 */
  DMATCD11_IRQn                = 15,               /**< DMA transfer complete and error CH11 */
  DMATCD12_IRQn                = 16,               /**< DMA transfer complete and error CH12 */
  DMATCD13_IRQn                = 17,               /**< DMA transfer complete and error CH13 */
  DMATCD14_IRQn                = 18,               /**< DMA transfer complete and error CH14 */
  DMATCD15_IRQn                = 19,               /**< DMA transfer complete and error CH15 */
  DMATCD16_IRQn                = 20,               /**< DMA transfer complete and error CH16 */
  DMATCD17_IRQn                = 21,               /**< DMA transfer complete and error CH17 */
  DMATCD18_IRQn                = 22,               /**< DMA transfer complete and error CH18 */
  DMATCD19_IRQn                = 23,               /**< DMA transfer complete and error CH19 */
  DMATCD20_IRQn                = 24,               /**< DMA transfer complete and error CH20 */
  DMATCD21_IRQn                = 25,               /**< DMA transfer complete and error CH21 */
  DMATCD22_IRQn                = 26,               /**< DMA transfer complete and error CH22 */
  DMATCD23_IRQn                = 27,               /**< DMA transfer complete and error CH23 */
  DMATCD24_IRQn                = 28,               /**< DMA transfer complete and error CH24 */
  DMATCD25_IRQn                = 29,               /**< DMA transfer complete and error CH25 */
  DMATCD26_IRQn                = 30,               /**< DMA transfer complete and error CH26 */
  DMATCD27_IRQn                = 31,               /**< DMA transfer complete and error CH27 */
  DMATCD28_IRQn                = 32,               /**< DMA transfer complete and error CH28 */
  DMATCD29_IRQn                = 33,               /**< DMA transfer complete and error CH29 */
  DMATCD30_IRQn                = 34,               /**< DMA transfer complete and error CH30 */
  DMATCD31_IRQn                = 35,               /**< DMA transfer complete and error CH31 */
  ERM_0_IRQn                   = 36,               /**< Single bit ECC error */
  ERM_1_IRQn                   = 37,               /**< Multi bit ECC error */
  MCM_IRQn                     = 38,               /**< FPU ORed sources ORed with MCM Write Abort interrupt */
  STM0_IRQn                    = 39,               /**< Single interrupt vector for all four channels */
  STM1_IRQn                    = 40,               /**< Single interrupt vector for all four channels */
  Reserved57_IRQn              = 41,               /**< Reserved interrupt */
  SWT0_IRQn                    = 42,               /**< Platform watchdog initial time-out */
  SWT1_IRQn                    = 43,               /**< Platform watchdog initial time-out */
  Reserved60_IRQn              = 44,               /**< Reserved interrupt */
  CTI_INT0_IRQn                = 45,               /**< CTI interrupt0 */
  CTI_INT1_IRQn                = 46,               /**< CTI interrupt1 */
  Reserved63_IRQn              = 47,               /**< Reserved interrupt */
  FLASH_0_IRQn                 = 48,               /**< Program or erase operation is completed */
  FLASH_1_IRQn                 = 49,               /**< Main watchdog timeout interrupt */
  FLASH_2_IRQn                 = 50,               /**< Alternate watchdog timeout interrupt */
  RGM_IRQn                     = 51,               /**< Interrupt request to the system */
  PMC_IRQn                     = 52,               /**< One interrupt for all LVDs, One interrupt for all HVDs */
  SIUL2_0_IRQn                 = 53,               /**< External Interrupt Vector 0 */
  SIUL2_1_IRQn                 = 54,               /**< External Interrupt Vector 1 */
  SIUL2_2_IRQn                 = 55,               /**< External Interrupt Vector 2 */
  SIUL2_3_IRQn                 = 56,               /**< External Interrupt Vector 3 */
  EMIOS0_2_IRQn                = 61,               /**< Interrupt request 23, 22, 21, 20 */
  EMIOS0_3_IRQn                = 62,               /**< Interrupt request 19, 18, 17, 16 */
  EMIOS0_4_IRQn                = 63,               /**< Interrupt request 15, 14, 13, 12 */
  EMIOS0_5_IRQn                = 64,               /**< Interrupt request 11, 10, 9, 8 */
  EMIOS0_6_IRQn                = 65,               /**< Interrupt request 7, 6, 5, 4 */
  EMIOS0_7_IRQn                = 66,               /**< Interrupt request 3, 2, 1, 0 */
  Reserved83_IRQn              = 67,               /**< Reserved interrupt */
  Reserved84_IRQn              = 68,               /**< Reserved interrupt */
  EMIOS1_2_IRQn                = 69,               /**< Interrupt request 23, 22, 21, 20 */
  EMIOS1_3_IRQn                = 70,               /**< Interrupt request 19, 18, 17, 16 */
  EMIOS1_4_IRQn                = 71,               /**< Interrupt request 15, 14, 13, 12 */
  EMIOS1_5_IRQn                = 72,               /**< Interrupt request 11, 10, 9, 8 */
  EMIOS1_6_IRQn                = 73,               /**< Interrupt request 7, 6, 5, 4 */
  EMIOS1_7_IRQn                = 74,               /**< Interrupt request 3, 2, 1, 0 */
  Reserved91_IRQn              = 75,               /**< Reserved interrupt */
  Reserved92_IRQn              = 76,               /**< Reserved interrupt */
  EMIOS2_2_IRQn                = 77,               /**< Interrupt request 23, 22, 21, 20 */
  EMIOS2_3_IRQn                = 78,               /**< Interrupt request 19, 18, 17, 16 */
  EMIOS2_4_IRQn                = 79,               /**< Interrupt request 15, 14, 13, 12 */
  EMIOS2_5_IRQn                = 80,               /**< Interrupt request 11, 10, 9, 8 */
  EMIOS2_6_IRQn                = 81,               /**< Interrupt request 7, 6, 5, 4 */
  EMIOS2_7_IRQn                = 82,               /**< Interrupt request 3, 2, 1, 0 */
  WKPU_IRQn                    = 83,               /**< Interrupts from pad group 0, 1, 2, 3, 0_64, 1_64, 2_64, 3_64 */
  CMU0_IRQn                    = 84,               /**< CMU0 interrupt */
  CMU1_IRQn                    = 85,               /**< CMU1 interrupt */
  CMU2_IRQn                    = 86,               /**< CMU2 interrupt */
  BCTU_IRQn                    = 87,               /**< Ored interrupt for BCTU */
  Reserved104_IRQn             = 88,               /**< Reserved interrupt */
  Reserved105_IRQn             = 89,               /**< Reserved interrupt */
  Reserved106_IRQn             = 90,               /**< Reserved interrupt */
  Reserved107_IRQn             = 91,               /**< Reserved interrupt */
  LCU0_IRQn                    = 92,               /**< Interrupt_0, 1, 2 */
  LCU1_IRQn                    = 93,               /**< Interrupt_0, 1, 2 */
  Reserved110_IRQn             = 94,               /**< Reserved interrupt */
  Reserved111_IRQn             = 95,               /**< Reserved interrupt */
  PIT0_IRQn                    = 96,               /**< Interrupt for Channel0, Channel1, Channel2, Channel3, Channel4 */
  PIT1_IRQn                    = 97,               /**< Interrupt for Channel0, Channel1, Channel2, Channel3 */
  PIT2_IRQn                    = 98,               /**< Interrupt for Channel0, Channel1, Channel2, Channel3 */
  Reserved115_IRQn             = 99,               /**< Reserved interrupt */
  Reserved116_IRQn             = 100,              /**< Reserved interrupt */
  Reserved117_IRQn             = 101,              /**< Reserved interrupt */
  RTC_IRQn                     = 102,              /**< RTCF or ROVRF interrupt to be serviced by the system controller */
  Reserved119_IRQn             = 103,              /**< Reserved interrupt */
  Reserved120_IRQn             = 104,              /**< Reserved interrupt */
  EMAC_0_IRQn                  = 105,              /**< Common interrupt */
  EMAC_1_IRQn                  = 106,              /**< Tx interrupt 0 and 1 */
  EMAC_2_IRQn                  = 107,              /**< rx interrupt 0 */
  EMAC_3_IRQn                  = 108,              /**< safety interrupt correctable */
  FlexCAN0_0_IRQn              = 109,              /**< Ored status and error */
  FlexCAN0_1_IRQn              = 110,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN0_2_IRQn              = 111,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN0_3_IRQn              = 112,              /**< Message Buffer Interrupt line 64-95 */
  FlexCAN1_0_IRQn              = 113,              /**< Ored status and error */
  FlexCAN1_1_IRQn              = 114,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN1_2_IRQn              = 115,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN2_0_IRQn              = 116,              /**< Ored status and error */
  FlexCAN2_1_IRQn              = 117,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN2_2_IRQn              = 118,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN3_0_IRQn              = 119,              /**< Ored status and error */
  FlexCAN3_1_IRQn              = 120,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN4_0_IRQn              = 121,              /**< Ored status and error */
  FlexCAN4_1_IRQn              = 122,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN5_0_IRQn              = 123,              /**< Ored status and error */
  FlexCAN5_1_IRQn              = 124,              /**< Message Buffer Interrupt line 0-31 */
  FLEXIO_IRQn                  = 139,              /**< FlexIO Interrupt */
  LPUART_0_IRQn                = 141,              /**< TX and RX interrupt */
  LPUART_1_IRQn                = 142,              /**< TX and RX interrupt */
  LPUART_2_IRQn                = 143,              /**< TX and RX interrupt */
  LPUART_3_IRQn                = 144,              /**< TX and RX interrupt */
  LPUART_4_IRQn                = 145,              /**< TX and RX interrupt */
  LPUART_5_IRQn                = 146,              /**< TX and RX interrupt */
  LPUART_6_IRQn                = 147,              /**< TX and RX interrupt */
  LPUART_7_IRQn                = 148,              /**< TX and RX interrupt */
  LPUART_8_IRQn                = 149,              /**< TX and RX interrupt */
  LPUART_9_IRQn                = 150,              /**< TX and RX interrupt */
  LPUART_10_IRQn               = 151,              /**< TX and RX interrupt */
  LPUART_11_IRQn               = 152,              /**< TX and RX interrupt */
  LPUART_12_IRQn               = 153,              /**< TX and RX interrupt */
  LPUART_13_IRQn               = 154,              /**< TX and RX interrupt */
  LPUART_14_IRQn               = 155,              /**< TX and RX interrupt */
  LPUART_15_IRQn               = 156,              /**< TX and RX interrupt */
  Reserved173_IRQn             = 157,              /**< Reserved interrupt */
  Reserved174_IRQn             = 158,              /**< Reserved interrupt */
  Reserved175_IRQn             = 159,              /**< Reserved interrupt */
  Reserved176_IRQn             = 160,              /**< Reserved interrupt */
  LPI2C0_IRQn                  = 161,              /**< LPI2C Interrupt */
  LPI2C1_IRQn                  = 162,              /**< LPI2C Interrupt */
  Reserved179_IRQn             = 163,              /**< Reserved interrupt */
  Reserved180_IRQn             = 164,              /**< Reserved interrupt */
  LPSPI0_IRQn                  = 165,              /**< LPSPI Interrupt */
  LPSPI1_IRQn                  = 166,              /**< LPSPI Interrupt */
  LPSPI2_IRQn                  = 167,              /**< LPSPI Interrupt */
  LPSPI3_IRQn                  = 168,              /**< LPSPI Interrupt */
  LPSPI4_IRQn                  = 169,              /**< LPSPI Interrupt */
  LPSPI5_IRQn                  = 170,              /**< LPSPI Interrupt */
  Reserved187_IRQn             = 171,              /**< Reserved interrupt */
  Reserved188_IRQn             = 172,              /**< Reserved interrupt */
  QSPI_IRQn                    = 173,              /**< All interrupts ORed output */
  SAI0_IRQn                    = 174,              /**< RX and TX interrupt */
  SAI1_IRQn                    = 175,              /**< RX and TX interrupt */
  Reserved192_IRQn             = 176,              /**< Reserved interrupt */
  Reserved193_IRQn             = 177,              /**< Reserved interrupt */
  JDC_IRQn                     = 178,              /**< Indicates new data to be read from JIN_IPS register or can be written to JOUT_IPS register */
  Reserved195_IRQn             = 179,              /**< Reserved interrupt */
  ADC0_IRQn                    = 180,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC1_IRQn                    = 181,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC2_IRQn                    = 182,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  CMP0_IRQn                    = 183,              /**< Async interrupt */
  CMP1_IRQn                    = 184,              /**< Async interrupt */
  CMP2_IRQn                    = 185,              /**< Async interrupt */
  FCCU_0_IRQn                  = 189,              /**< Interrupt request (ALARM state) */
  FCCU_1_IRQn                  = 190,              /**< Interrupt request (miscellaneous conditions) */
  STCU_IRQn                    = 191,              /**< LBIST and MBIST IRQ */
  MU0_B_TX_IRQn                = 192,              /**< ORed TX interrupt to MU-0 */
  MU0_B_RX_IRQn                = 193,              /**< ORed RX interrupt to MU-0 */
  MU0_B_IRQn                   = 194,              /**< ORed general purpose interrupt request to MU-0 */
  MU1_B_TX_IRQn                = 195,              /**< ORed TX interrupt to MU-1 */
  MU1_B_RX_IRQn                = 196,              /**< ORed RX interrupt to MU-1 */
  MU1_B_IRQn                   = 197,              /**< ORed general purpose interrupt request to MU-1 */
  Reserved214_IRQn             = 198,              /**< Reserved interrupt */
  Reserved215_IRQn             = 199,              /**< Reserved interrupt */
  Reserved216_IRQn             = 200,              /**< Reserved interrupt */
  Reserved217_IRQn             = 201,              /**< Reserved interrupt */
  MU2_A_TX_IRQn                = 202,              /**< Ored tx interrupt to MUA */
  MU2_A_RX_IRQn                = 203,              /**< Ored rx interrupt to MUA */
  MU2_A_IRQn                   = 204,              /**< ORed general purpose interrupt request to MUA */
  MU2_B_TX_IRQn                = 205,              /**< Ored tx interrupt to MUB */
  MU2_B_RX_IRQn                = 206,              /**< Ored rx interrupt to MUB */
  MU2_B_IRQn                   = 207,              /**< ORed general purpose interrupt request to MUB */
  Reserved224_IRQn             = 208,              /**< Reserved interrupt */
  Reserved225_IRQn             = 209,              /**< Reserved interrupt */
  Reserved226_IRQn             = 210,              /**< Reserved interrupt */
  Reserved227_IRQn             = 211,              /**< Reserved interrupt */
  PLL_LOL_IRQn                 = 212,              /**< PLL LOL interrupt */
  CORE_CLK_FAIL_IRQn           = 213,              /**< CORE_CLK_FAIL CMU reset reaction interrupt */
  Reserved230_IRQn             = 214,              /**< Reserved interrupt */
  AIPS_PLAT_CLK_FAIL_IRQn      = 215,              /**< AIPS_PLAT_CLK_FAIL CMU reset reaction interrupt */
  Reserved232_IRQn             = 216,              /**< Reserved interrupt */
  HSE_B_CLK_FAIL_IRQn          = 217,              /**< HSE_B_CLK_FAIL CMU reset reaction interrupt */
  Reserved234_IRQn             = 218,              /**< Reserved interrupt */
  Reserved235_IRQn             = 219,              /**< Reserved interrupt */
  Reserved236_IRQn             = 220,              /**< Reserved interrupt */
  Reserved237_IRQn             = 221,              /**< Reserved interrupt */
  Reserved238_IRQn             = 222,              /**< Reserved interrupt */
  Reserved239_IRQn             = 223               /**< Reserved interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M7 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M7 Core Configuration
 * @{
 */

